PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p16f1773.inc
;----- PWM6CON Bits -----------------------------------------------------
POL_PWM6CON      EQU  H'0004'
OUT_PWM6CON      EQU  H'0005'
EN               EQU  H'0007'

PWM6MODE0        EQU  H'0002'
PWM6MODE1        EQU  H'0003'

PWM6POL          EQU  H'0004'
PWM6OUT          EQU  H'0005'
PWM6EN           EQU  H'0007'

MODE0_PWM6CON    EQU  H'0002'
MODE1_PWM6CON    EQU  H'0003'


;----- PWM6INTCON Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM6PRIE         EQU  H'0000'
PWM6DCIE         EQU  H'0001'
PWM6PHIE         EQU  H'0002'
PWM6OFIE         EQU  H'0003'


;----- PWM6INTE Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM6PRIE         EQU  H'0000'
PWM6DCIE         EQU  H'0001'
PWM6PHIE         EQU  H'0002'
PWM6OFIE         EQU  H'0003'


;----- PWM6INTF Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM6PRIF         EQU  H'0000'
PWM6DCIF         EQU  H'0001'
PWM6PHIF         EQU  H'0002'
PWM6OFIF         EQU  H'0003'


;----- PWM6INTFLG Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM6PRIF         EQU  H'0000'
PWM6DCIF         EQU  H'0001'
PWM6PHIF         EQU  H'0002'
PWM6OFIF         EQU  H'0003'


;----- PWM6CLKCON Bits -----------------------------------------------------
PWM6CS0          EQU  H'0000'
PWM6CS1          EQU  H'0001'
PWM6CS2          EQU  H'0002'
PWM6PS0          EQU  H'0004'
PWM6PS1          EQU  H'0005'
PWM6PS2          EQU  H'0006'


CS0_PWM6CLKCON   EQU  H'0000'
CS1_PWM6CLKCON   EQU  H'0001'
CS2              EQU  H'0002'
PS0_PWM6CLKCON   EQU  H'0004'
PS1_PWM6CLKCON   EQU  H'0005'
PS2_PWM6CLKCON   EQU  H'0006'


;----- PWM6LDCON Bits -----------------------------------------------------
LDT              EQU  H'0006'
LDA              EQU  H'0007'

PWM6LDS0         EQU  H'0000'
PWM6LDS1         EQU  H'0001'

PWM6LDM          EQU  H'0006'
PWM6LD           EQU  H'0007'

LDS0             EQU  H'0000'
LDS1             EQU  H'0001'


;----- PWM6OFCON Bits -----------------------------------------------------
OFO              EQU  H'0004'

PWM6OFS0         EQU  H'0000'
PWM6OFS1         EQU  H'0001'
PWM6OFM0         EQU  H'0005'
PWM6OFM1         EQU  H'0006'

PWM6OFMC         EQU  H'0004'

OFS0             EQU  H'0000'
OFS1             EQU  H'0001'
OFM0             EQU  H'0005'
OFM1             EQU  H'0006'


;----- PWM11PHL Bits -----------------------------------------------------
PWM11PHL0        EQU  H'0000'
PWM11PHL1        EQU  H'0001'
PWM11PHL2        EQU  H'0002'
PWM11PHL3        EQU  H'0003'
PWM11PHL4        EQU  H'0004'
PWM11PHL5        EQU  H'0005'
PWM11PHL6        EQU  H'0006'
PWM11PHL7        EQU  H'0007'



;----- PWM11PHH Bits -----------------------------------------------------
PWM11PHH0        EQU  H'0000'
PWM11PHH1        EQU  H'0001'
PWM11PHH2        EQU  H'0002'
PWM11PHH3        EQU  H'0003'
PWM11PHH4        EQU  H'0004'
PWM11PHH5        EQU  H'0005'
PWM11PHH6        EQU  H'0006'
PWM11PHH7        EQU  H'0007'



;----- PWM11DCL Bits -----------------------------------------------------
PWM11DCL0        EQU  H'0000'
PWM11DCL1        EQU  H'0001'
PWM11DCL2        EQU  H'0002'
PWM11DCL3        EQU  H'0003'
PWM11DCL4        EQU  H'0004'
PWM11DCL5        EQU  H'0005'
PWM11DCL6        EQU  H'0006'
PWM11DCL7        EQU  H'0007'



;----- PWM11DCH Bits -----------------------------------------------------
PWM11DCH0        EQU  H'0000'
PWM11DCH1        EQU  H'0001'
PWM11DCH2        EQU  H'0002'
PWM11DCH3        EQU  H'0003'
PWM11DCH4        EQU  H'0004'
PWM11DCH5        EQU  H'0005'
PWM11DCH6        EQU  H'0006'
PWM11DCH7        EQU  H'0007'



;----- PWM11PRL Bits -----------------------------------------------------
PWM11PRL0        EQU  H'0000'
PWM11PRL1        EQU  H'0001'
PWM11PRL2        EQU  H'0002'
PWM11PRL3        EQU  H'0003'
PWM11PRL4        EQU  H'0004'
PWM11PRL5        EQU  H'0005'
PWM11PRL6        EQU  H'0006'
PWM11PRL7        EQU  H'0007'



;----- PWM11PRH Bits -----------------------------------------------------
PWM11PRH0        EQU  H'0000'
PWM11PRH1        EQU  H'0001'
PWM11PRH2        EQU  H'0002'
PWM11PRH3        EQU  H'0003'
PWM11PRH4        EQU  H'0004'
PWM11PRH5        EQU  H'0005'
PWM11PRH6        EQU  H'0006'
PWM11PRH7        EQU  H'0007'



;----- PWM11OFL Bits -----------------------------------------------------
PWM11OFL0        EQU  H'0000'
PWM11OFL1        EQU  H'0001'
PWM11OFL2        EQU  H'0002'
PWM11OFL3        EQU  H'0003'
PWM11OFL4        EQU  H'0004'
PWM11OFL5        EQU  H'0005'
PWM11OFL6        EQU  H'0006'
PWM11OFL7        EQU  H'0007'



;----- PWM11OFH Bits -----------------------------------------------------
PWM11OFH0        EQU  H'0000'
PWM11OFH1        EQU  H'0001'
PWM11OFH2        EQU  H'0002'
PWM11OFH3        EQU  H'0003'
PWM11OFH4        EQU  H'0004'
PWM11OFH5        EQU  H'0005'
PWM11OFH6        EQU  H'0006'
PWM11OFH7        EQU  H'0007'



;----- PWM11TMRL Bits -----------------------------------------------------
PWM11TMRL0       EQU  H'0000'
PWM11TMRL1       EQU  H'0001'
PWM11TMRL2       EQU  H'0002'
PWM11TMRL3       EQU  H'0003'
PWM11TMRL4       EQU  H'0004'
PWM11TMRL5       EQU  H'0005'
PWM11TMRL6       EQU  H'0006'
PWM11TMRL7       EQU  H'0007'



;----- PWM11TMRH Bits -----------------------------------------------------
PWM11TMRH0       EQU  H'0000'
PWM11TMRH1       EQU  H'0001'
PWM11TMRH2       EQU  H'0002'
PWM11TMRH3       EQU  H'0003'
PWM11TMRH4       EQU  H'0004'
PWM11TMRH5       EQU  H'0005'
PWM11TMRH6       EQU  H'0006'
PWM11TMRH7       EQU  H'0007'



;----- PWM11CON Bits -----------------------------------------------------
POL_PWM11CON     EQU  H'0004'
OUT_PWM11CON     EQU  H'0005'
EN               EQU  H'0007'

